In [1]:
import pandas as pd

In [4]:
nba = pd.read_csv("nba.csv")

nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [6]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     373 non-null object
Salary      446 non-null float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [8]:
 nba.Name.head(3)

0    Avery Bradley
1      Jae Crowder
2     John Holland
Name: Name, dtype: object

In [12]:
nba.College.head(3)

0                Texas
1            Marquette
2    Boston University
Name: College, dtype: object

In [16]:
nba["Name"].head(3) # better if there's space in the column

0    Avery Bradley
1      Jae Crowder
2     John Holland
Name: Name, dtype: object

In [18]:
nba[["Name", "College"]].head(3)

            Name            College
0  Avery Bradley              Texas
1    Jae Crowder          Marquette
2   John Holland  Boston University